[Killed] ConditionalExpression
src/analiseDeDados.js:28:14
       if (this.dados.length === 0) return null;
       const ordenado = this.ordenarDados();
       const meio = Math.floor(ordenado.length / 2);
-      return ordenado.length % 2 === 0 ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
+      return true ? (ordenado[meio - 1] + ordenado[meio]) / 2 : ordenado[meio];
     }
   
killedBy: AnaliseDeDados Deve calcular a mediana corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 25
